{
  "_class_name": "FlowMatchEulerDiscreteScheduler",
  "_diffusers_version": "0.37.0",
  "num_train_timesteps": 1000,
  "shift": 1.0,
  "use_dynamic_shifting": false,
  "base_shift": 0.5,
  "max_shift": 1.15,
  "base_image_seq_len": 256,
  "max_image_seq_len": 4096
}
