{
  "_class_name": "AutoencoderKLFlux2",
  "_diffusers_version": "0.37.0",
  "in_channels": 3,
  "out_channels": 3,
  "down_block_types": ["DownEncoderBlock2D", "DownEncoderBlock2D", "DownEncoderBlock2D", "DownEncoderBlock2D"],
  "up_block_types": ["UpDecoderBlock2D", "UpDecoderBlock2D", "UpDecoderBlock2D", "UpDecoderBlock2D"],
  "block_out_channels": [128, 256, 512, 512],
  "layers_per_block": 2,
  "act_fn": "silu",
  "latent_channels": 32,
  "norm_num_groups": 32,
  "sample_size": 1024,
  "force_upcast": true,
  "use_quant_conv": true,
  "use_post_quant_conv": true,
  "mid_block_add_attention": true,
  "batch_norm_eps": 0.0001,
  "batch_norm_momentum": 0.1,
  "patch_size": [2, 2]
}
