{
  "architectures": ["Qwen2_5_VLForConditionalGeneration"],
  "model_type": "qwen2_5_vl",
  "dtype": "bfloat16",
  "hidden_act": "silu",
  "hidden_size": 3584,
  "intermediate_size": 18944,
  "max_position_embeddings": 128000,
  "max_window_layers": 28,
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "mrope_section": [16, 24, 24],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "image_token_id": 151655,
  "video_token_id": 151656,
  "vision_start_token_id": 151652,
  "vision_end_token_id": 151653,
  "vision_token_id": 151654,
  "vocab_size": 152064,
  "tie_word_embeddings": false,
  "use_cache": true,
  "use_sliding_window": false,
  "attention_dropout": 0.0,
  "initializer_range": 0.02,
  "text_config": {
    "model_type": "qwen2_5_vl_text",
    "hidden_size": 3584,
    "intermediate_size": 18944,
    "num_attention_heads": 28,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "hidden_act": "silu",
    "max_position_embeddings": 128000,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "mrope_section": [16, 24, 24],
      "rope_type": "default",
      "type": "default"
    },
    "rope_theta": 1000000.0,
    "vocab_size": 152064,
    "use_cache": true,
    "use_sliding_window": false
  },
  "vision_config": {
    "model_type": "qwen2_5_vl",
    "depth": 32,
    "fullatt_block_indexes": [7, 15, 23, 31],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "in_channels": 3,
    "intermediate_size": 3420,
    "num_heads": 16,
    "out_hidden_size": 3584,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "temporal_patch_size": 2,
    "window_size": 112
  }
}
