{
  "_class_name": "ChromaTransformer2DModel",
  "_diffusers_version": "0.37.0",
  "patch_size": 1,
  "in_channels": 64,
  "num_layers": 19,
  "num_single_layers": 38,
  "attention_head_dim": 128,
  "num_attention_heads": 24,
  "joint_attention_dim": 4096,
  "axes_dims_rope": [16, 56, 56],
  "approximator_num_channels": 64,
  "approximator_hidden_dim": 5120,
  "approximator_layers": 5
}
