{
  "_class_name": "ZImageControlNetModel",
  "_diffusers_version": "0.38.0",
  "add_control_noise_refiner": "control_noise_refiner",
  "all_f_patch_size": [1],
  "all_patch_size": [2],
  "control_in_dim": 33,
  "control_layers_places": [0, 10, 20],
  "control_refiner_layers_places": [0, 1],
  "dim": 3840,
  "n_heads": 30,
  "n_kv_heads": 30,
  "n_refiner_layers": 2,
  "norm_eps": 1e-05,
  "qk_norm": true
}
